---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData.GetAreaBasedLoadIds
source: html/c27d0636-3568-7c77-2f23-350489260904.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData.GetAreaBasedLoadIds Method

Gets the area based load ids of the electrical load area to be included.

## Syntax (C#)
```csharp
public ISet<ElementId> GetAreaBasedLoadIds()
```